// Перевести число 333 из шестнадцатиричной в десятичную
333 = 3 * 16 ^ 2 + 3 * 16 ^ 1 + 3 * 16 ^ 0 = (3 * 256) + (3 * 16) + (3 * 1) = 768 + 48 + 3 = 819;

333 = 819; // десятичная

// Разложить число 200345 на разряды в десятичной системе
200345 = 200000 + 300 + 40 + 5;

// Перевести 637 из десятичной в шестнадцатиричную и обратно (10->16 и 16->10)
637 / 16 = 39 (деление без остатка)
637 % 16 = 13 (остаток)
39 / 16 = 2 (деление без остатка)
39 % 16 = 7  (остаток)
2 / 16 = 0 (деление без остатка)
2 % 16 = 2 (остаток)
637 = 27; // шестнадцатиричная

27 = 2 * 16 ^ 1 + 7 * 16 ^ 0 = (2 * 16) + (7 * 1) = 32 + 7 = 39; // десятичная

// Перевести 637 из десятичной в двоичную
637 / 2 = 318 (деление без остатка)
637 % 2 = 1  (остаток)
318 / 2 = 159 (деление без остатка)
318 % 2 = 0 (остаток)
159 / 2 = 79 (деление без остатка)
159 % 2 = 1 (остаток)
79 / 2 = 39 (деление без остатка)
79 % 2 = 1 (остаток)
39 / 2 = 19 (деление без остатка)
39 % 2 = 1 (остаток)
19 / 2 = 9 (деление без остатка)
19 % 2 = 1 (остаток)
9 / 2 = 4 (деление без остатка)
9 % 2 = 1 (остаток)
4 / 2 = 2 (деление без остатка)
4 % 2 = 0 (остаток)
2 / 2 = 1 (деление без остатка)
2 % 2 = 0 (остаток)
1 / 2 = 0 (деление без остатка)
1 % 2 = 1 (остаток)

637 = 1011111001; // двоичная

//11100111 перевести в десятичную
11100111  = 1 * 2 ^ 7 + 1 * 2 ^ 6 + 1 * 2 ^ 5 + 0 * 2 ^ 4 + 0 * 2 ^ 3 + 1 * 2 ^ 2 + 1 * 2 ^ 1 + 1 * 2 ^ 0 =
(1 * 128) + (1 * 64) + (1 * 32) + (0 * 16) + (0 * 8) + (1 * 4) + (1 * 2) + (1 * 1) =
128 + 64 + 32 + 0 + 0 + 4 + 2 + 1 = 231;

11100111 = 231 // десятичная

//Перевести 637 из десятичной в троичную
637 / 3 = 212 (деление без остатка)
637 % 3 = 1   (остаток)
212 / 3 = 70 (деление без остатка)
212 % 3 = 2  (остаток)
70 / 3 = 23 (деление без остатка)
70 % 3 = 1  (остаток)
23 / 3 = 7 (деление без остатка)
23 % 3 = 2 (остаток)
7 / 3 = 2 (деление без остатка)
7 % 3 = 1 (остаток)
2 / 3 = 0 (деление без остатка)
2 % 3 = 2 (остаток)

637 = 212121; // троичная





